'''
Структурное программирование - функциональное программирование в
кооторое включаются условия/циклы и т.д.

Введение в ООП
ООП требуется в тех случайх когда проектируются большие программы
В основе языка заложено ООП.
1)Наследование это один из столбов ООП (создаем класс на основе базового)
2)Полиморфизм это второй столб ООП (созданный на базе старого класса новый
класс является новым, про базовый мы можем не знать)
3)Инкапсуляция (закрытие данных от внешнего вмешательнства, упрощение кода)

Наследование - когда свойство одних обьектов мы передаем в другие
Полиморфизм - изменение свойств класса родителя под дочерние нужды\
Инкапсуляция - сокрытие внутренней реализации функционала от пользователей
обьектов классаи 


'''

